In [1]:
import pandas as pd
import numpy as np

In [4]:
apples = pd.Series([5,4,3,2])
oranges = pd.Series(['Tasty','Delicious','Juicy','Amazing'])
#print(apples, oranges)
dict = {'Apples':apples, 'Oranges':oranges}
Fruits = pd.DataFrame(dict)
print(Fruits)

   Apples    Oranges
0       5      Tasty
1       4  Delicious
2       3      Juicy
3       2    Amazing

In [9]:
test =pd.DataFrame(np.random.randn(5,4), index = ['F1','F2','F3','F4','F5'],
                  columns=['C1','C2','C3','C4'])
print(test)

          C1        C2        C3        C4
F1  2.165114 -1.336814 -1.917892 -1.027780
F2  0.630957 -0.605773  0.712567 -0.089149
F3  0.736045  1.274272 -0.824032  1.198889
F4 -0.134720  0.520010 -0.052046 -2.112591
F5  0.103716  0.103234 -0.189546  1.264737

In [10]:
dict = {'Country':['Pakistan','Pakistan','Pakistan','Japan','Japan','Japan'], 
        'Year':[2015,2016,2017,2015,2016,2017],
       'Population':['1M','2M','3M','0.5M','0.6M','0.7M']}
print(dict)

{'Country': ['Pakistan', 'Pakistan', 'Pakistan', 'Japan', 'Japan', 'Japan'], 'Year': [2015, 2016, 2017, 2015, 2016, 2017], 'Population': ['1M', '2M', '3M', '0.5M', '0.6M', '0.7M']}

In [14]:
df2 = pd.DataFrame(dict, index=['D1','D2','D3','D4', 'D5', 'D6'])
print(df2)

     Country  Year Population
D1  Pakistan  2015         1M
D2  Pakistan  2016         2M
D3  Pakistan  2017         3M
D4     Japan  2015       0.5M
D5     Japan  2016       0.6M
D6     Japan  2017       0.7M

In [17]:
df2.head()

     Country  Year Population
D1  Pakistan  2015         1M
D2  Pakistan  2016         2M
D3  Pakistan  2017         3M
D4     Japan  2015       0.5M
D5     Japan  2016       0.6M

In [18]:
display(df2)

     Country  Year Population
D1  Pakistan  2015         1M
D2  Pakistan  2016         2M
D3  Pakistan  2017         3M
D4     Japan  2015       0.5M
D5     Japan  2016       0.6M
D6     Japan  2017       0.7M

In [19]:
df2 = pd.DataFrame(dict, index=['D1','D2','D3','D4', 'D5', 'D6'], columns=['Year','Country','Population'])
print(df2)

    Year   Country Population
D1  2015  Pakistan         1M
D2  2016  Pakistan         2M
D3  2017  Pakistan         3M
D4  2015     Japan       0.5M
D5  2016     Japan       0.6M
D6  2017     Japan       0.7M

In [21]:
df2.columns

Index(['Year', 'Country', 'Population'], dtype='object')

In [22]:
df2.index

Index(['D1', 'D2', 'D3', 'D4', 'D5', 'D6'], dtype='object')

In [24]:
print(df2.Country) # This is a attribute style
print(df2['Country']) #Normal Style

D1    Pakistan
D2    Pakistan
D3    Pakistan
D4       Japan
D5       Japan
D6       Japan
Name: Country, dtype: object
D1    Pakistan
D2    Pakistan
D3    Pakistan
D4       Japan
D5       Japan
D6       Japan
Name: Country, dtype: object

In [26]:
#what if we want to acces particular Index ??? How
# For that we use iloc function.
# in loc command we give exact name of the index

In [27]:
df2.loc['D1']

Year              2015
Country       Pakistan
Population          1M
Name: D1, dtype: object

In [ ]:
#For accesing default index we use iloc
# We select default location

In [29]:
df2.iloc[0]

Year              2015
Country       Pakistan
Population          1M
Name: D1, dtype: object

In [31]:
df2.iloc[1:5]

    Year   Country Population
D2  2016  Pakistan         2M
D3  2017  Pakistan         3M
D4  2015     Japan       0.5M
D5  2016     Japan       0.6M

In [ ]:
#How to insert new columns values

In [33]:
dict = {'Country':['Pakistan','Pakistan','Pakistan','Japan','Japan','Japan'], 
        'Year':[2015,2016,2017,2015,2016,2017],
       'Population':['1M','2M','3M','0.5M','0.6M','0.7M']}
df3 = pd.DataFrame(dict,columns=['Year', 'State','Population','Earning', 'Country'])
display(df3)

   Year State Population Earning   Country
0  2015   NaN         1M     NaN  Pakistan
1  2016   NaN         2M     NaN  Pakistan
2  2017   NaN         3M     NaN  Pakistan
3  2015   NaN       0.5M     NaN     Japan
4  2016   NaN       0.6M     NaN     Japan
5  2017   NaN       0.7M     NaN     Japan

In [35]:
#Now putting values in Earning columnabs

In [41]:
l= len(df3)
l
val = np.arange(l)
val
df3['Earning']= val
df3

   Year State Population  Earning   Country
0  2015   NaN         1M        0  Pakistan
1  2016   NaN         2M        1  Pakistan
2  2017   NaN         3M        2  Pakistan
3  2015   NaN       0.5M        3     Japan
4  2016   NaN       0.6M        4     Japan
5  2017   NaN       0.7M        5     Japan

In [ ]:
#Simple procedure for single value to insert in columns

In [42]:
df3['Earning'] = 100
df3

   Year State Population  Earning   Country
0  2015   NaN         1M      100  Pakistan
1  2016   NaN         2M      100  Pakistan
2  2017   NaN         3M      100  Pakistan
3  2015   NaN       0.5M      100     Japan
4  2016   NaN       0.6M      100     Japan
5  2017   NaN       0.7M      100     Japan

In [58]:
c = np.arange(500,506)
c

array([500, 501, 502, 503, 504, 505])

In [59]:
df3['State'] = c
df3

   Year  State Population  Earning   Country  state
0  2015    500         1M      100  Pakistan    500
1  2016    501         2M      100  Pakistan    500
2  2017    502         3M      100  Pakistan    500
3  2015    503       0.5M      100     Japan    500
4  2016    504       0.6M      100     Japan    500
5  2017    505       0.7M      100     Japan    500